README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OpenFOAM Third-Party packages 2.2.x</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="OpenFOAM Third-Party packages 2.2.x"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="6th March 2013"/>
<meta name="author" content="The OpenFOAM Foundation"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">OpenFOAM Third-Party packages 2.2.x</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Description</a></li>
<li><a href="#sec-2">2 The approximate order of execution:</a>
<ul>
<li><a href="#sec-2-1">2.1 Optional</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Versions and locations for the third party packages used</a>
<ul>
<li><a href="#sec-3-1">3.1 Compiler</a></li>
<li><a href="#sec-3-2">3.2 Parallel Processing</a></li>
<li><a href="#sec-3-3">3.3 Misc</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Notes</a>
<ul>
<li><a href="#sec-4-1">4.1 Buiding ParaView</a></li>
<li><a href="#sec-4-2">4.2 Building QT</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">

<p>  Scripts for building third-party packages.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The approximate order of execution:</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>makeGcc
</li>
<li>Allwmake
</li>
<li>makeQt (optional)
</li>
<li>makeParaView
</li>
</ul>



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Optional</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>AllwmakeLibccmio
</li>
<li>Allclean
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Versions and locations for the third party packages used</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Compiler</h3>
<div class="outline-text-3" id="text-3-1">

<p>    The minimum version of gcc required is 4.5.0
</p><ul>
<li>gcc   <a href="http://gcc.gnu.org/releases.html">http://gcc.gnu.org/releases.html</a>
</li>
<li>gmp   <a href="http://gmplib.org/">http://gmplib.org/</a>
            <a href="ftp://ftp.gnu.org/gnu/gmp/gmp-5.0.4.tar.bz2">ftp://ftp.gnu.org/gnu/gmp/gmp-5.0.4.tar.bz2</a>
</li>
<li>mpfr  <a href="http://www.mpfr.org/">http://www.mpfr.org/</a>
            <a href="ftp://ftp.gnu.org/gnu/mpfr/mpfr-3.1.0.tar.bz2">ftp://ftp.gnu.org/gnu/mpfr/mpfr-3.1.0.tar.bz2</a>
</li>
<li>mpc   <a href="http://www.multiprecision.org/">http://www.multiprecision.org/</a>
            <a href="http://www.multiprecision.org/mpc/download/mpc-0.9.tar.gz">http://www.multiprecision.org/mpc/download/mpc-0.9.tar.gz</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Parallel Processing</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>openmpi
<ul>
<li><a href="http://www.open-mpi.org/software/ompi/v1.6/downloads/openmpi-1.6.3.tar.bz2">http://www.open-mpi.org/software/ompi/v1.6/downloads/openmpi-1.6.3.tar.bz2</a>
</li>
</ul>

</li>
<li>scotch      <a href="https://gforge.inria.fr/frs/download.php/31831/scotch_6.0.0.tar.gz">https://gforge.inria.fr/frs/download.php/31831/scotch_6.0.0.tar.gz</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Misc</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>cmake       <a href="http://www.cmake.org/files/v2.8/cmake-2.8.4.tar.gz">http://www.cmake.org/files/v2.8/cmake-2.8.4.tar.gz</a>
</li>
<li>Qt
<ul>
<li><a href="http://qt-project.org/downloads">http://qt-project.org/downloads</a>
</li>
<li><a href="ftp://ftp.qt-project.org/qt/source/qt-everywhere-opensource-src-4.7.3.tar.gz">ftp://ftp.qt-project.org/qt/source/qt-everywhere-opensource-src-4.7.3.tar.gz</a>
</li>
<li><a href="ftp://ftp.qt-project.org/qt/source/qt-everywhere-opensource-src-4.6.3.tar.gz">ftp://ftp.qt-project.org/qt/source/qt-everywhere-opensource-src-4.6.3.tar.gz</a>
</li>
</ul>

</li>
<li>paraview    <a href="http://www.paraview.org/files/v3.12/ParaView-3.12.0.tar.gz">http://www.paraview.org/files/v3.12/ParaView-3.12.0.tar.gz</a>
</li>
<li>libccmio    <a href="https://wci.llnl.gov/codes/visit/3rd_party/libccmio-2.6.1.tar.gz">https://wci.llnl.gov/codes/visit/3rd_party/libccmio-2.6.1.tar.gz</a>
</li>
<li>tecio       <a href="http://download.tecplot.com/tecio/2009/tecio2009.zip">http://download.tecplot.com/tecio/2009/tecio2009.zip</a>
</li>
<li>CGAL        <a href="https://gforge.inria.fr/frs/download.php/31175/CGAL-4.0.2.tar.gz">https://gforge.inria.fr/frs/download.php/31175/CGAL-4.0.2.tar.gz</a>
</li>
<li>boost       <a href="http://sourceforge.net/projects/boost/files/boost/1.45.0/boost_1_45_0.tar.bz2/download">http://sourceforge.net/projects/boost/files/boost/1.45.0/boost_1_45_0.tar.bz2/download</a>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Notes</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Buiding ParaView</h3>
<div class="outline-text-3" id="text-4-1">

<p>    The ParaView sources included in this pack include a minor change compared
    to the official version 3.12 distribution, based on the VTK mantis report:
</p><ul>
<li><a href="http://vtk.org/Bug/view.php?id=12881">http://vtk.org/Bug/view.php?id=12881</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Building QT</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>set your QT_DIR/PATH/LD_LIBRARY_PATH
<ul>
<li>see the README provided with the QT sources to complete your installation
</li>
</ul>

</li>
<li>when building ParaView, use the -qmake option to direct the build process to
      your new QT install
<ul>
<li>for more info, see: <code>./makeParaView -help</code>
</li>
</ul>

</li>
</ul>


<p>
    If Qt is relocated after being built, these files need adjusting:
</p><ul>
<li>QT-PATH/bin/qt.conf
</li>
<li>QT-PATH/lib/pkgconfig/*.pc
</li>
</ul>

<p>    The etc/relocateQt script can help here.
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 6th March 2013</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
